from aiogram import Router, F
from aiogram.types import Message
from os import getenv

handler_rules = Router()

async def build_rules():
    admin_ids = getenv("ADMINS").split(",")
    message_rules = """
<b>📖 Правила и помощь</b>

<b>1. Ограничения использования</b>  
Запрещается отправлять частые повторяющиеся сообщения, флудить или спамить бота.  
При выявлении чрезмерной активности доступ может быть временно или полностью ограничен.

<b>2. Ответственность пользователя</b>  
Пользователь самостоятельно несёт ответственность за все действия, совершаемые с использованием бота.  
Используя бота, вы соглашаетесь с тем, что принимаете на себя возможные риски и последствия, связанные с его использованием.

<b>3. Общие положения</b>  
Администрация не несёт ответственности за прямой или косвенный ущерб, возникший в результате использования сервиса.

━━━━━━━━━━━━━━━
<b>📩 Контакты администрации:</b>
    """
    for admin_id in admin_ids:
        message_rules += f'🔹 <a href="tg://user?id={admin_id}">Администратор</a>\n'
    return message_rules

@handler_rules.message(F.text == "🛟Правила и помощь")
async def rules(message: Message):
    rules_msg = await build_rules()
    await message.answer(rules_msg, parse_mode="HTML")