from aiogram import Router
from aiogram.types import Message
from aiogram.filters.command import CommandStart
from src.bot.keyboards.user import keyboard_default

handler_startup = Router()

startup_message = """
<b>👋 Добро пожаловать в наш AI-бот!</b>

Здесь вы можете общаться с современными моделями искусственного интеллекта:

<b>🤖 Доступные модели:</b>

• <b>LLaMA</b>: <code>8b</code> | <code>70b</code> | <code>405b</code>  
• <b>Mistral</b>: <code>7b</code>  
• <b>Gemma</b>: <code>7b</code>  
• <b>Arctic</b>  
• <b>Nemotron</b>: <code>340b</code>  
• <b>DeepSeek</b>: <code>v3</code>  
• <b>Phi</b>: <code>3mini</code>  
• <b>Qwen</b>: <code>3coder</code>  
• <b>Kimi</b>: <code>2.5</code>

Каждая модель имеет свои особенности — выберите подходящую и начните общение 🚀

━━━━━━━━━━━━━━━━━━

<b>📌 Как пользоваться ботом?</b>

<b>🆕 Новый чат</b>
Начать диалог с выбранной моделью.

<b>👤 Профиль</b>
Посмотреть статус аккаунта и количество использованных запросов.
Также здесь можно улучшить статус до <b>Премиум</b> ⭐ с помощью Telegram Stars.

<b>🤖 Модели</b>
Просмотреть список доступных моделей и выбрать текущую для общения.

<b>🛟 Правила и помощь</b>
Информация о боте, правила использования и контакты поддержки.

━━━━━━━━━━━━━━━━━━

Начните общение прямо сейчас 💬

"""

@handler_startup.message(CommandStart())
async def startup(message: Message):
    await message.answer(startup_message, reply_markup=keyboard_default, parse_mode="HTML")